## Simple example of how swaping dataframe axes

In [2]:
import pandas as pd

In [3]:
dict1 = {'name': 'john', 'age': 30, 'city': 'new york'}
dict2 = {'name': 'susan', 'age': 32, 'city': 'boston'}

In [4]:
df = pd.DataFrame.from_dict(dict1, orient='index')

In [5]:
df

             0
name      john
age         30
city  new york

In [6]:
df = df.swapaxes('index', 'columns')

In [7]:
df

   name age      city
0  john  30  new york

In [8]:
df_temp = pd.DataFrame.from_dict(dict2, orient='index').swapaxes('index', 'columns')

In [9]:
df_temp

    name age    city
0  susan  32  boston

In [10]:
df = df.append(df_temp)

In [11]:
df

    name age      city
0   john  30  new york
0  susan  32    boston

In [13]:
df = df.reset_index(drop=True)

In [14]:
df

    name age      city
0   john  30  new york
1  susan  32    boston